
const button = document.querySelector('.btn')
const outputValuesOnPage = document.querySelector('.out')

// Cleaner 
const clearAllCheckBoxes = () => {
    const uncheckBoxes = document.querySelectorAll('input[type=checkbox][name=vladArc]')
    for (i = 0; i < 10; i++) {
        uncheckBoxes[i].checked = false;
    }
    return;
}

const parseAndOutputValues = () => {

    const selectedSubj = Array.from(document.querySelectorAll("input[type=checkbox][name=vladArc]:checked")).map(e => e.value)
    const vacancies = {
        // История + Биология 
        'historyOfUa-biology': "Дошкільна освіта</br>Середня освіта.Фізична культура,",
        // История + Математика 
        'historyOfUa-math': "Публічне управління та адміністрування*</br>Право*</br>Початкова освіта</br> Політологія</br>Дошкільна освіта</br>Журналістика і соціальна комунікація</br>Інформаційна, бібліотечна та архівна справа </br>Соціологія",
        // Биология + География 
        'biology-geography': "Екологія, охорона навколишнього середовища та збалансоване природокористування</br>Середня освіта.Фізична культура",
        // История + Язык
        'historyOfUa-language': "Міжнародне право*</br>Право*</br>Філологія. Переклад (новогрецька)</br>Філологія. Мова та література (новогрецька)</br>Філологія. Мова та література (російська)</br>Філологія. Переклад(українська, російська, польська)</br>Філологія. Переклад(англійська)</br>Середня освіта. Мова і література (російська)</br>Середня освіта. Мова і література (новогрецька) </br>Філологія. Переклад (італійська)</br>Філологія. Мова та література (французька)</br>Філологія. Мова та література (німецька)</br>Філологія. Мова та література (англійська)</br>Середня освіта. Мова і література (італійська)</br>Середня освіта. Мова і література (французька)</br>Середня освіта. Мова і література (німецька)</br>Середня освіта. Мова і література(англійська)</br>Міжнародні відносини*</br> Політологія</br> Середня освіта.Українська мова і література</br>Філологія. Українська мова талітература</br>Журналістика і соціальна комунікація</br>Середня освіта. Історія</br>Інформаційна, бібліотечна та архівна справа</br>Історія</br>Культурологія",
        // Язык + География
        'language-geography': "Міжнародні економічні відносини. Міжнародний бізнес*</br>Туризм</br>Філологія. Переклад (новогрецька)</br>Філологія. Мова та література (новогрецька)</br>Філологія. Мова та література (російська)</br>Філологія. Переклад(українська, російська, польська)</br>Філологія. Переклад(англійська)</br>Середня освіта. Мова і література (російська)</br>Середня освіта. Мова і література (новогрецька) </br>Філологія. Переклад (італійська)</br>Філологія. Мова та література (французька)</br>Філологія. Мова та література (німецька)</br>Філологія. Мова та література (англійська)</br>Середня освіта. Мова і література (італійська)</br>Середня освіта. Мова і література (французька)</br>Середня освіта. Мова і література (німецька)</br>Середня освіта. Мова і література(англійська)</br>Філологія.Українська мова та література",
        // Математика + Биология
        'math-biology': "Екологія, охорона навколишнього середовища та збалансоване природокористування</br>Початкова освіта</br>Практична психологія",
        // Язык + Математика
        'language-math': "Міжнародні економічні відносини. Міжнародний бізнес*</br>Туризм</br>Кібербезпека</br>Системний аналіз</br>Публічне управління та адміністрування*</br>Міжнародне право*</br>Менеджмент</br> Міжнародна економіка</br>Міжнародні відносини*</br>Практична психологія</br>Соціологія",
        // География + История
        'geography-historyOfUa': "Середня освіта.Історія</br>Історія</br>Культурологія",
        // География + Математика 
        'geography-math': "Менеджмент</br>Міжнародна економіка</br>",
        // Биология + Химия 
        'biology-chemistry': "Екологія, охорона навколишнього середовища та збалансоване природокористування</br>",
        // Математика + Физика
        'math-physics': 'Кібербезпека</br>Системний аналіз</br>'
    }

    if (selectedSubj.length) {

        // !--!--!
        const result = Object.entries(vacancies)
            .find(([subjects, vacancy]) => {
                const isSuitable = subjects                // parse array [selectedSubj == input.value ] and compare with {vacancies} variation and output
                    .split('-')
                    .every(subject => selectedSubj.includes(subject))

                if (isSuitable) {
                    return vacancy
                } else {
                    outputValuesOnPage.innerHTML = "Пусто 😢😢"
                }

            })

        if (selectedSubj.length == 1) outputValuesOnPage.innerHTML = "🔎 Виберіть два предмети"
        // check for undefined result values in {vacancies} variation
        result == undefined ? clearAllCheckBoxes() : outputValuesOnPage.innerHTML = result[1] + "</br></br><b>* Мінімальний конкурсний бал для участі у конкурсному відборі – 140</b>", clearAllCheckBoxes()
    } else {
        // if press button and  box is not selected 
        return;
    }
}
//event 
button.addEventListener('click', parseAndOutputValues)









